validation/openfoam13/axialFlowTurbineAL_minimal/Allrun
#!/bin/sh
set -eu

if [ -z "${WM_PROJECT_VERSION:-}" ]; then
    echo "OpenFOAM n'est pas chargé. Sourcez etc/bashrc avant Allrun." >&2
    exit 1
fi

case "$WM_PROJECT_VERSION" in
    13|13.*) ;;
    *) echo "Cas prévu pour OpenFOAM 13, version détectée: $WM_PROJECT_VERSION" >&2; exit 1 ;;
esac

: "${FOAM_USER_LIBBIN:?FOAM_USER_LIBBIN doit contenir libturbinesFoam.so}"

command -v blockMesh >/dev/null
command -v checkMesh >/dev/null
command -v foamRun >/dev/null

blockMesh
checkMesh -constant
foamRun -solver incompressibleFluid
