validation/openfoam13/axialFlowTurbineAL_minimal/constant/resources/foilData/S826_1e5_Ostavan
// From Ostavan (2013); digitized from plots in Cakmakcioglu et al. (2014)
// Re = 1e5
// (alpha_deg cl cd)
(-9.924717691342533 -0.4290100381330593 0.13502538071065995)
(-8.94604767879548 -0.4295961277084323 0.10944162436548227)
(-7.967377666248431 -0.4226063210991272 0.0838578680203046)
(-6.913425345043912 -0.306005904858487 0.05248730964467002)
(-4.9560853199498105 -0.09491937147837329 0.031776649746192875)
(-2.9611041405269773 0.20820814665290455 0.019289340101522837)
(-0.9284818067754051 0.4197905220671855 0.01685279187817257)
(1.0288582183186958 0.611537650438956 0.025685279187817267)
(3.061480552070261 0.8129539349753445 0.029644670050761383)
(5.056461731493105 1.002670901933393 0.03482233502538068)
(7.013801756587203 1.1209509777649516 0.04091370558375634)
(9.046424090338773 1.1854642827057449 0.05461928934010152)
(11.041405269761617 1.1940103155654709 0.07350253807106594)
(12.020075282308655 1.1855346072770412 0.09451776649746196)
(14.052697616060223 1.1682223011557766 0.12192893401015233)
(15.031367628607276 1.1582949974668337 0.15208121827411164)
(16.01003764115433 1.121780691657613 0.19015228426395947)
(18.080301129234627 1.0444638623442768 0.2946192893401016)
(20.037641154328732 0.9695146881964188 0.3503553299492386)
(21.99498117942284 0.955893504797967 0.3984771573604061)
(24.0276035131744 0.9740292435712301 0.4456852791878173)
